Tekla Open API Reference for Tekla Structures 2025
ProfileItemEnumerator Properties
The ProfileItemEnumerator type exposes the following members.
Properties
Name | Description
Current
 Returns a profile item instance of the current element.
SelectInstances
 Indicates that the instance Select() is called when the 'Current' item is asked from the enumerator. The user can set this to 'false' if no members are ever asked from the instance. This is the case when, for example, asking only for the available profile names or when only certain profiles need to be selected from the model. Without the selection the 'Current' item contains the profile name or the prefix and the profile type. Warning: normally the user should not change this value.
Top
See Also
Reference
ProfileItemEnumerator Class
Tekla.Structures.Catalogs Namespace